Revit 2027 API
Edge.Reference Property
Returns a stable reference to the edge.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Reference Reference { get; }
Public ReadOnly Property Reference As Reference
	Get
public:
property Reference^ Reference {
	Reference^ get ();
}
member Reference : Reference with get
Property Value
Reference
Remarks
This value is if the corresponding geometry object does not permit referencing.
See Also
Reference
Edge Class
Autodesk.Revit.DB Namespace